{"data":{"site":{"siteMetadata":{"title":"Essays","author":"Cian O'Regan"}},"markdownRemark":{"id":"147b0726-69ea-5d30-84ce-a822edb6c872","excerpt":"A dialogue between Man and his Soul  S: Who has dared to enter the desert for which I am. M: I have, I wish to understand why you ask so much from me? S: Are…","html":"<p>A dialogue between Man and his Soul </p>\n<p>S: Who has dared to enter the desert for which I am.</p>\n<p>M: I have, I wish to understand why you ask so much from me?</p>\n<p>S: Are you a fool or child?\nHave you allowed yourself to be stripped and eaten by my vultures of God?\nHave you given up earthy reigns in order to attain entry to the blessed isles?\nOr, have you acted as the pathetic fool I know you are, one which rots at its core, one which satiates desire after desire, one which lets others frock on your soul. Even with all of this.. you still you assert some worth despite your hollow, twisted core?</p>\n<p>M: I am willingly to destroy myself, I can let it all dissolve - but will that be enough, what lies beneath this apparition, what will I experience if I fall to the depths of being, my heart and intellect tremble of such a place.</p>\n<p>S: If you wish to dance to the songs of the dead you must first relinquish the grasp of being for you alone are not equipped to hold it. The sun of judgement beads on your tiny heart thus will burn it alive, does that sound admirable, does that sound enjoyable, or does it sound absolutely necessary.\nYou stand now at the gates of being, to enter you must set a blaze all previous gods for they are heavy and weak and shall not float in these depths, do you accept my command?</p>\n<p>M: I accept.</p>\n<p>S: Then let us begin, take my hand and I shall guide you, the blind man, through the lowest levels of the soul, here you will become eternal and nocturnal all at once, for here is where your ancestors have danced and cried, you too will learn to dance to the poorest tunes, do you understand?</p>\n<p>M: I do.</p>\n<p>S: Let us go and let us reclaim you who are, rather who you are meant to be.</p>","frontmatter":{"title":"TheEmbrace","date":"February 02, 2019"}}},"pageContext":{"slug":"/Embraceman/","previous":{"fields":{"slug":"/Self/"},"frontmatter":{"title":"TheEmbrace"}},"next":{"fields":{"slug":"/Paradise-Lost/"},"frontmatter":{"title":"Paradise Lost"}}}}