{"data":{"site":{"siteMetadata":{"title":"Essays","author":"Cian O'Regan"}},"markdownRemark":{"id":"147b0726-69ea-5d30-84ce-a822edb6c872","excerpt":"  The Embrace\n Dramatis Personæ :\n Nietzsche : Passion and overcoming\n Schopenhauer : Cold truth We find two of our philosophically minded friends by the…","html":"<p>  The Embrace\n<strong>Dramatis Personæ</strong>:\n<strong>Nietzsche</strong>: Passion and overcoming\n<strong>Schopenhauer</strong>: Cold truth</p>\n<p><em>We find two of our philosophically minded friends by the seaside during the darkness of night</em></p>\n<p>NIETZCHE: Verily, it seems we have encountered under the stars and moonlight; coincidence or not Schopenhauer I demand another glimpse of your tongue, for these matters of life scream for examination!\nSCHOPENHAUER: Please leave me alone, YOU festering creep.</p>\n<p>NIETZCHE: Thunderous, spiteful proclamations cannot will this conversation back towards the abyss my friend!\nSCHOPENHAUER: If I speak with you and your <em>ridiculous</em> mus-tache will you make this charade end quick?\nNIETZCHE: Aha! I knew you would follow me to the heights my friend, here we can discuss what strikes man as the most powerful of ideas!\nSCHOPENHAUER: Fine. You have defiantly interrupted my precious <em>silence</em>, all for your mindless noise.. what do you wish to speak upon? Well?!\nNIETZCHE: I have read your most recent and brooding of works, you assert the futility of our existence. Do you see no way out? Do you wish to destroy the horizon like the madman warned when he proclaimed of the gods demise? Is this what you want? Ask yourself this, can man alone act as the captain of a vessel through the plains of infinite nothingness? My spirit believes so; the blood still runs through our hearts friend thus we mustn’t surrender to the calls of the abyss! The image of our creators heart was punctured with a divine sword, he has bled too much thus we stand here naked under the stars covered in his blood.</p>\n<p>You however, your writings send a crashing wave through my very soul, this destabilisation is enough to wake the mountains of Vesuvius and burn a generation of laughter alive. I can recover from this for I can handle such a feat my friend, but I worry you are wishing to rip the sun from earth without any hope of revitalising the soil! There is however a way for man to ascend out from this wretched pit of <em>chaos</em>.</p>\n<p>SCHOPENHAUER: Hah, your fear is masked by your passion Nietzsche. My works speak of the truth which our species begs to distort. For what is <em>being</em>?  I will tell you, the compound of fleeting desires, misguided passions and numbing vanity; this is why I reject fools like you who share my air, you, the great fool, Friedrich Nietzsche, the man who’s corpus inspired some of the greatest catastrophes our planet has ever witnessed, yet you demand for my explanations? Does your spirit not allure you to the folly of your own existence? You created hell ten times over and demand for my reconsideration? I at least have the courage to state the world in its boldest, truest form!   </p>\n<p>NIETZSCHE: ENOUGH! ENOUGH I SAY. My debt has not yet been paid to mankind, therefore I furiously work now to undo what has been done in my spirit! I wrote in blood and died in blood; my words were uttered by the rabble of man not by the Free Spirits. You know my dear Zarathustra wished for nothing but the heights, he wished to laugh upon the depths and untie the knot around mans neck! A will of that kind can relinquish the noose around any a species neck my dear friend, even man!\nSCHOPENHAUER: You are a fool. You died a mad fool. You will <em>remain</em> a fool. You share much of traits of the madman you proclaim in jest, for little did his fear know the death of god was no loss; rather an awakening to what this world is in its purest state.  </p>\n<p>NIETZSCHE: I do not refute our lot, I embrace it and transform, a series of metamorphic emergences. Who among my peers have ever wished to help man before me? Rather, they wished to keep their<br>\n“<em>truths</em>” immutable for personal gain, I believe your work speaks more of you than of your “<em>truth</em>”, one which rots your soul.\nSCHOPENHAUER: If my truth rots me then so be it, I prefer honesty over charlatans. You, the blubbering madman, you remind me of the lamb in the field, who dances and cheers unknowingly awaiting the butchers blade, you like all men also dance and cheer, you laugh from the heights, but the butcher will strike against your throat with his knife; can you not deny that is the fate of man? Surely the blubbering creep will acknowledge the abyss does not rest under us; rather we lie in it.\nNIETZSCHE: Verily, you have confused my path for one of joy and tulips; rather my path is filled with roses, in the sense of their <em>thorns</em>, you see my friend nothing is worth true beauty without the stab of a prick! AHA!\nSCHOPENHAUER: For heavens sake..\nNIETZSCHE: Hah! Now, your apathy bleeds me dry friend, listen before I faint with the boredom you speak so much of, for I have a story to tell you. There once lived a man who’s birth coincided with the death of a galaxy; he lived upon a glimmering rock in the cosmic swing of the universe, here, he wished to inject a frenzy into man, one which propels man to the peak and overcomes the depths. Thus, Upon this rock, which rested itself above the starved, chattering abyss, this man decided that he would relinquish the collection of jewels he collected in his youth back unto the world.\nSCHOPENHAUER: Yes, yes fascinating. Man, rock, jewels, dynamite stuff you fool. I am bored.\nNIETZSCHE: Everything bores you, I am yet to finish.\nSCHOPENHAUER: Ah what a pity, I on the other hand am.</p>\n<p><em>An ominous man approaches from the dark</em>\nCAMUS: Hello Gentleman, what a lovely night we have under the endless sky, Oh, to explore the universe like the fallen raindrop which explores a lonely leaf, that would surely fill ones heart with love and joy!\nNIETZSCHE: This man speaks of lonely leafs yet I am the fool?\nSCHOPENHAUER: BE GONE FROM THIS WORLD CAMUS, YOU ARE THE WORST THING THIS ROCK HAS PUKED THUS FAR.\nCAMUS: hah, my <em>friends</em>, I always enjoy a good ribbing…\nNIETZSCHE: So be it, you shall receive one song of the heart before I go; let this speak my meaning onto you both.</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">The Fallen Citadel   \n\nOh here I kneel again within the void,\nMany suns used to dance around this icy space,\nFor who can now cast their eyes to the brightest smiles?\nFor who can see in this darkest place?\nFor who can still taste the blissful warmth of light?\nFor who will speak of highest peaks in such a pit?\nFor Now the children weep while the cold bites at souls,\nFor I see poison which gnaws at the hearts of many sheep,\nFor this I ask, who can wrap blankets upon piercing souls?  \nDoes infirmity compel our spirit to these depths?\nPerhaps I will light all thus forth? Verily, I summon light amongst the rot,\nMan will emerge anew, conquerer and adorer of his fate,\nWe must make pace for times pointed teeth begs for the throats of men and women,\nSo say this forth,\nI alone spark light in the coldest gulf, I alone scorch divine embers in bottomless depths, I alone burn the hearts of gods and drink from the wine of the sun,\nFor now I rest in the blessed isles with gifts for man who’s  wish is warmth,\nSo now I call out, embrace ones luck before you refute ones lot!\nAnd this is my song</code></pre></div>\n<p>SCHOPENHAUER: That was badly timed and full of contradictions. Did you write that as a child?</p>\n<p>Something dawned upon me while you spoke. I began to think, these <em>nebulous</em> words you splutter, do they not act as merely the blanket for <em>your</em> trembling soul, not for the soul of man. Do you think they can protect you from what your spirit knows to be true?\nThink on that before you dare speak to me of “<em>bottomless depths</em>”. I am leaving and hope to not experience your presence once more. I also question any <em>man</em> who recites poetry during the darkness of night…\nCAMUS: WAIT, wait, this song strikes my heart as eternal beauty, do you not see the truth in his words? This man wishes to lick the moon and kiss the sun during our earthly reign; this is something I can appreciate! I do not know you well friend, But you have an ear who begs to hear more!</p>\n<p>SCHOPENHAUER: No, no. <em>Enough</em>.</p>\n<p>NIETZSCHE: Perhaps another time my new friend, for now I grow weary and must rest.\nGoodbye and let my words rest easy on any soul who wishes for nourishing light amongst the dead.</p>\n<p><em>The three spirits part ways with a frenzy of ideas chattering within each man</em></p>\n<p>The End</p>","frontmatter":{"title":"TheEmbrace","date":"February 02, 2019"}}},"pageContext":{"slug":"/Embraceman/","previous":null,"next":{"fields":{"slug":"/Paradise-Lost/"},"frontmatter":{"title":"Paradise Lost"}}}}